In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
obj = pd.Series([1,5,10, 7], index=["a","b","c","d"])
obj

a     1
b     5
c    10
d     7
dtype: int64

In [ ]:
10 in obj # Fast

False

In [ ]:
"b" in obj # fast

True

In [5]:
obj.values

array([ 1,  5, 10,  7])

In [ ]:
7 in obj.values # slow

True

In [7]:
d = {
    "Name": ["John", "Alice", "Jack", "Rose", "Alex", "David"],
    "Age": [32, 23, 21, 35, 45, 48],
    "City": ["Istanbul", "Paris", "London", "Madrid", "Sao Paulo", "Miami"]
}
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami']}

In [9]:
df = pd.DataFrame(d)
df

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [10]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [13]:
df.values

array([['John', 32, 'Istanbul'],
       ['Alice', 23, 'Paris'],
       ['Jack', 21, 'London'],
       ['Rose', 35, 'Madrid'],
       ['Alex', 45, 'Sao Paulo'],
       ['David', 48, 'Miami']], dtype=object)

In [14]:
df.shape

(6, 3)

In [15]:
df

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [16]:
df.head() # displays first 5 rows

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo

In [17]:
df.head(3)

    Name  Age      City
0   John   32  Istanbul
1  Alice   23     Paris
2   Jack   21    London

In [18]:
df.tail()

    Name  Age       City
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [19]:
df.tail(2)

    Name  Age       City
4   Alex   45  Sao Paulo
5  David   48      Miami

In [20]:
df

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [21]:
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami']}

In [23]:
d["Name"]

['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David']

In [24]:
df["Name"]

0     John
1    Alice
2     Jack
3     Rose
4     Alex
5    David
Name: Name, dtype: object

In [25]:
df

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [ ]:
df["Age"] # it returns a Series object

0    32
1    23
2    21
3    35
4    45
5    48
Name: Age, dtype: int64

In [28]:
type(df["Age"])

pandas.core.series.Series

In [ ]:
df[["Name", "Age"]] # it returns a DataFrame

    Name  Age
0   John   32
1  Alice   23
2   Jack   21
3   Rose   35
4   Alex   45
5  David   48

In [29]:
type(df[["Name", "Age"]])

pandas.core.frame.DataFrame

In [ ]:
df["Age"] # series

0    32
1    23
2    21
3    35
4    45
5    48
Name: Age, dtype: int64

In [ ]:
df[["Age"]] # DataFrame

   Age
0   32
1   23
2   21
3   35
4   45
5   48

In [32]:
df

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [33]:
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami']}

In [34]:
d["newKey"] = [10, 2,4, 6, 5,7]
d

{'Name': ['John', 'Alice', 'Jack', 'Rose', 'Alex', 'David'],
 'Age': [32, 23, 21, 35, 45, 48],
 'City': ['Istanbul', 'Paris', 'London', 'Madrid', 'Sao Paulo', 'Miami'],
 'newKey': [10, 2, 4, 6, 5, 7]}

In [35]:
df

    Name  Age       City
0   John   32   Istanbul
1  Alice   23      Paris
2   Jack   21     London
3   Rose   35     Madrid
4   Alex   45  Sao Paulo
5  David   48      Miami

In [36]:
df["University"] = "Sabanci University"
df

    Name  Age       City          University
0   John   32   Istanbul  Sabanci University
1  Alice   23      Paris  Sabanci University
2   Jack   21     London  Sabanci University
3   Rose   35     Madrid  Sabanci University
4   Alex   45  Sao Paulo  Sabanci University
5  David   48      Miami  Sabanci University

In [37]:
df["Debt"] = [10, 2, 0, 7, 12, 15]
df

    Name  Age       City          University  Debt
0   John   32   Istanbul  Sabanci University    10
1  Alice   23      Paris  Sabanci University     2
2   Jack   21     London  Sabanci University     0
3   Rose   35     Madrid  Sabanci University     7
4   Alex   45  Sao Paulo  Sabanci University    12
5  David   48      Miami  Sabanci University    15

In [38]:
df["Debt"] = [10, 20, 0, 17, 12, 15]
df

    Name  Age       City          University  Debt
0   John   32   Istanbul  Sabanci University    10
1  Alice   23      Paris  Sabanci University    20
2   Jack   21     London  Sabanci University     0
3   Rose   35     Madrid  Sabanci University    17
4   Alex   45  Sao Paulo  Sabanci University    12
5  David   48      Miami  Sabanci University    15

In [40]:
df["Age"]

0    32
1    23
2    21
3    35
4    45
5    48
Name: Age, dtype: int64

In [41]:
df.Age

0    32
1    23
2    21
3    35
4    45
5    48
Name: Age, dtype: int64

In [42]:
df.shape

(6, 5)

In [43]:
df

    Name  Age       City          University  Debt
0   John   32   Istanbul  Sabanci University    10
1  Alice   23      Paris  Sabanci University    20
2   Jack   21     London  Sabanci University     0
3   Rose   35     Madrid  Sabanci University    17
4   Alex   45  Sao Paulo  Sabanci University    12
5  David   48      Miami  Sabanci University    15

In [ ]:
df.drop("University", axis=1) # returns a new DataFrame

    Name  Age       City  Debt
0   John   32   Istanbul    10
1  Alice   23      Paris    20
2   Jack   21     London     0
3   Rose   35     Madrid    17
4   Alex   45  Sao Paulo    12
5  David   48      Miami    15

In [45]:
df

    Name  Age       City          University  Debt
0   John   32   Istanbul  Sabanci University    10
1  Alice   23      Paris  Sabanci University    20
2   Jack   21     London  Sabanci University     0
3   Rose   35     Madrid  Sabanci University    17
4   Alex   45  Sao Paulo  Sabanci University    12
5  David   48      Miami  Sabanci University    15

In [46]:
#df = df.drop("University", axis=1)
df.drop("University", axis=1, inplace=True)

In [47]:
df

    Name  Age       City  Debt
0   John   32   Istanbul    10
1  Alice   23      Paris    20
2   Jack   21     London     0
3   Rose   35     Madrid    17
4   Alex   45  Sao Paulo    12
5  David   48      Miami    15

In [48]:
df.drop(["Age", "Debt"], axis=1, inplace=True)

In [49]:
df

    Name       City
0   John   Istanbul
1  Alice      Paris
2   Jack     London
3   Rose     Madrid
4   Alex  Sao Paulo
5  David      Miami

In [ ]:
df.drop([1, 4], axis=0, inplace=True)

In [51]:
df

    Name      City
0   John  Istanbul
2   Jack    London
3   Rose    Madrid
5  David     Miami

In [53]:
val = df.values
val

array([['John', 'Istanbul'],
       ['Jack', 'London'],
       ['Rose', 'Madrid'],
       ['David', 'Miami']], dtype=object)

In [54]:
pd.DataFrame(val)

       0         1
0   John  Istanbul
1   Jack    London
2   Rose    Madrid
3  David     Miami

In [56]:
orders = pd.read_table("http://bit.ly/chiporders")
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [57]:
orders.shape

(4622, 5)